app/views/school_classes/index.html.erb

SELECT "school_classes".* FROM "school_classes"
---
<ul>
  <% SchoolClass.all.each do |c| %>