app/controllers/school_classes_controller.rb

SELECT "school_classes".* FROM "school_classes"
---
  def index
    @school_classes = SchoolClasses.all

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Kindergarden Cop"], ["room_number", 101], ["created_at", "2019-04-09 02:59:04.176232"], ["updated_at", "2019-04-09 02:59:04.176232"]]
---
  def create
    @school_class = SchoolClass.new(params.require(:school_class).permit(:title, :room_number))
    @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-04-08 02:26:08.797496"], ["id", 1]]
---
  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(params.require(:school_class).permit(:title, :room_number))