app/controllers/students_controller.rb

SELECT "students".* FROM "students"
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-04-08 02:30:08.350251"], ["updated_at", "2019-04-08 02:30:08.350251"]]
---
  def create
    @student = Student.new()
    @student.first_name = params[:student_first_name]
    @student.last_name = params[:student_last_name]
    @student.save

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-04-08 02:42:39.320098"], ["id", 1]]
---
  def update
    @student.update(
      first_name: params[:student][:first_name],
      last_name: params[:student][:last_name])